In [5]:
%matplotlib inline
import pandas as pd

In [7]:
titles = pd.read_csv('pycon-pandas-tutorial/data/titles.csv')
titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2   The Spider and the Fly  1949
3                  Country  2000
4          The Golden Note  2017

In [8]:
cast = pd.read_csv('pycon-pandas-tutorial/data/cast.csv')
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### How many movies are listed in the titles dataframe?

In [9]:
len(titles)

244914

### What are the earliest two films listed in the titles dataframe?

In [12]:
titles.sort_values('year').head(2)

                     title  year
187327          Miss Jerry  1894
226857  The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [14]:
len(titles[titles.title=="Hamlet"])

20

### How many movies are titled "North by Northwest"?

In [15]:
len(titles[titles.title=="North by Northwest"])

1

### When was the first movie titled "Hamlet" made?

In [20]:
t=titles
t[t.title=="Hamlet"].sort_values('year').head(1)

        title  year
49308  Hamlet  1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [21]:
t[t.title=="Treasure Island"].sort_values('year')

                  title  year
217091  Treasure Island  1918
54095   Treasure Island  1920
201357  Treasure Island  1934
102046  Treasure Island  1950
81338   Treasure Island  1972
117328  Treasure Island  1973
216419  Treasure Island  1985
189010  Treasure Island  1999

### How many movies were made in the year 1950?

In [23]:
len(t[t.year==1950])

1113

### How many movies were made in the year 1960?

In [26]:
len(t[t.year==1960])

1549

### How many movies were made from 1950 through 1959?

In [28]:
len(t[(t.year>=1950) & (t.year<=1959)])

12934

### In what years has a movie titled "Batman" been released?

In [30]:
t[t.title=="Batman"]

        title  year
59052  Batman  1989
78565  Batman  1943

### How many roles were there in the movie "Inception"?

In [31]:
c=cast
len(c[c.title=="Inception"])

78

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

### But how many roles in the movie "Inception" did receive an "n" value?

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

### How many roles were credited in the silent 1921 version of Hamlet?

### How many roles were credited in Branaghâ€™s 1996 Hamlet?

### How many "Hamlet" roles have been listed in all film credits through history?

### How many people have played an "Ophelia"?

### How many people have played a role called "The Dude"?

### How many people have played a role called "The Stranger"?

### How many roles has Sidney Poitier played throughout his career?

### How many roles has Judi Dench played?

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

### List the leading roles that Cary Grant played in the 1940s in order by year.

### How many roles were available for actors in the 1950s?

### How many roles were available for actresses in the 1950s?

### How many leading roles (n=1) were available from the beginning of film history through 1980?

### How many non-leading roles were available through from the beginning of film history through 1980?

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?